# BasisU Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UV..::..BasisU Property
UV Class See Also
---
The basis of the U axis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static UV BasisU { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BasisU As UV
	Get
```

Visual C++
---
```text
public:
static property UV^ BasisU {
	UV^ get ();
}
```

# Remarks
The basis of the U axis is the vector (1,0), the unit vector on the U axis.
# See Also
UV Class
Autodesk.Revit.DB Namespace